In [118]:
import numpy as np
import pandas as pd


data = {
    'f_name': ['Dipak', 'Ramesh', 'Sita', 'Gita', 'Anup', 'Gita', 'Mira', 'Sundar', 'Manoj', 'Ganesh'],
    'l_name': ['Prasai', 'Ghale', 'Mahatara', np.nan, 'Bagale', 'Tamang', 'Shah', 'Gurung', 'Ghale', np.nan],
    'age': [32, 45, 21, 15, 36, np.nan, 85, 41, 32, 12],
    'weight': [65, 72, 55, 40, 58, 62, np.nan, 65, 55, 20], 
    'balance': [150000, 200000, 25000, 5000, 500000, 200000, 50000, 256000, 78000, 25000]
}

df = pd.DataFrame(data)

In [119]:
# Add new column
df['full_name'] = df['f_name'] + " " + df['l_name'] # deep
df

   f_name    l_name   age  weight  balance      full_name
0   Dipak    Prasai  32.0    65.0   150000   Dipak Prasai
1  Ramesh     Ghale  45.0    72.0   200000   Ramesh Ghale
2    Sita  Mahatara  21.0    55.0    25000  Sita Mahatara
3    Gita       NaN  15.0    40.0     5000            NaN
4    Anup    Bagale  36.0    58.0   500000    Anup Bagale
5    Gita    Tamang   NaN    62.0   200000    Gita Tamang
6    Mira      Shah  85.0     NaN    50000      Mira Shah
7  Sundar    Gurung  41.0    65.0   256000  Sundar Gurung
8   Manoj     Ghale  32.0    55.0    78000    Manoj Ghale
9  Ganesh       NaN  12.0    20.0    25000            NaN

In [120]:
df0 = df.assign(bonus = df['age'] * 5/10, allowance = df['age'] * 2) # shallow
df0

   f_name    l_name   age  weight  balance      full_name  bonus  allowance
0   Dipak    Prasai  32.0    65.0   150000   Dipak Prasai   16.0       64.0
1  Ramesh     Ghale  45.0    72.0   200000   Ramesh Ghale   22.5       90.0
2    Sita  Mahatara  21.0    55.0    25000  Sita Mahatara   10.5       42.0
3    Gita       NaN  15.0    40.0     5000            NaN    7.5       30.0
4    Anup    Bagale  36.0    58.0   500000    Anup Bagale   18.0       72.0
5    Gita    Tamang   NaN    62.0   200000    Gita Tamang    NaN        NaN
6    Mira      Shah  85.0     NaN    50000      Mira Shah   42.5      170.0
7  Sundar    Gurung  41.0    65.0   256000  Sundar Gurung   20.5       82.0
8   Manoj     Ghale  32.0    55.0    78000    Manoj Ghale   16.0       64.0
9  Ganesh       NaN  12.0    20.0    25000            NaN    6.0       24.0

In [121]:
# Rename column(s) name
df.rename(columns={'f_name':'First Name', 'l_name':'Last Name','age':'Age', 'weight':'Weight', 'balance':'Balance'})

  First Name Last Name   Age  Weight  Balance      full_name
0      Dipak    Prasai  32.0    65.0   150000   Dipak Prasai
1     Ramesh     Ghale  45.0    72.0   200000   Ramesh Ghale
2       Sita  Mahatara  21.0    55.0    25000  Sita Mahatara
3       Gita       NaN  15.0    40.0     5000            NaN
4       Anup    Bagale  36.0    58.0   500000    Anup Bagale
5       Gita    Tamang   NaN    62.0   200000    Gita Tamang
6       Mira      Shah  85.0     NaN    50000      Mira Shah
7     Sundar    Gurung  41.0    65.0   256000  Sundar Gurung
8      Manoj     Ghale  32.0    55.0    78000    Manoj Ghale
9     Ganesh       NaN  12.0    20.0    25000            NaN

In [122]:
# Drop/delete column(s)
# df.drop(columns={'full_name', 'balance'}) # shallow
df.drop(columns=['full_name', 'balance']) # shallow

   f_name    l_name   age  weight
0   Dipak    Prasai  32.0    65.0
1  Ramesh     Ghale  45.0    72.0
2    Sita  Mahatara  21.0    55.0
3    Gita       NaN  15.0    40.0
4    Anup    Bagale  36.0    58.0
5    Gita    Tamang   NaN    62.0
6    Mira      Shah  85.0     NaN
7  Sundar    Gurung  41.0    65.0
8   Manoj     Ghale  32.0    55.0
9  Ganesh       NaN  12.0    20.0

In [123]:
df['l_name'] = df['l_name'].replace({'Tamang':'Lama', np.nan: 'Nepali'})
# df['priority'].replace({'yes': True, 'no': False})
df

   f_name    l_name   age  weight  balance      full_name
0   Dipak    Prasai  32.0    65.0   150000   Dipak Prasai
1  Ramesh     Ghale  45.0    72.0   200000   Ramesh Ghale
2    Sita  Mahatara  21.0    55.0    25000  Sita Mahatara
3    Gita    Nepali  15.0    40.0     5000            NaN
4    Anup    Bagale  36.0    58.0   500000    Anup Bagale
5    Gita      Lama   NaN    62.0   200000    Gita Tamang
6    Mira      Shah  85.0     NaN    50000      Mira Shah
7  Sundar    Gurung  41.0    65.0   256000  Sundar Gurung
8   Manoj     Ghale  32.0    55.0    78000    Manoj Ghale
9  Ganesh    Nepali  12.0    20.0    25000            NaN

In [ ]:
# Drop the row(s)/index(s)
# df.drop(4) 
# df.drop(5, axis=0) # axis=0, optional/default
df.drop([6, 7, 8], axis=0)
# df.drop('k', axis=0)
# df.drop(['c', 'd', 'e'], axis=0)

   f_name    l_name   age  weight  balance      full_name
0   Dipak    Prasai  32.0    65.0   150000   Dipak Prasai
1  Ramesh     Ghale  45.0    72.0   200000   Ramesh Ghale
2    Sita  Mahatara  21.0    55.0    25000  Sita Mahatara
3    Gita    Nepali  15.0    40.0     5000            NaN
4    Anup    Bagale  36.0    58.0   500000    Anup Bagale
5    Gita      Lama   NaN    62.0   200000    Gita Tamang
9  Ganesh    Nepali  12.0    20.0    25000            NaN

In [ ]:
# Rename index(s)/row(s)
df.rename({2:20, 3:30})
df.rename({2:20, 3:30}, axis=0)
df.rename(index={2:20, 3:30})
df.rename({'a':'A', 'b':'B'})

   f_name    l_name   age  weight  balance      full_name
0   Dipak    Prasai  32.0    65.0   150000   Dipak Prasai
1  Ramesh     Ghale  45.0    72.0   200000   Ramesh Ghale
2    Sita  Mahatara  21.0    55.0    25000  Sita Mahatara
3    Gita    Nepali  15.0    40.0     5000            NaN
4    Anup    Bagale  36.0    58.0   500000    Anup Bagale
5    Gita      Lama   NaN    62.0   200000    Gita Tamang
6    Mira      Shah  85.0     NaN    50000      Mira Shah
7  Sundar    Gurung  41.0    65.0   256000  Sundar Gurung
8   Manoj     Ghale  32.0    55.0    78000    Manoj Ghale
9  Ganesh    Nepali  12.0    20.0    25000            NaN